ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_СкидкиПоставщика/ЖБИ_СкидкиПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_СкидкиПоставщика</name>
  <comment>ЖБИ - Скидки поставщика</comment>
  <resources>
    <name>ПроцентСкидки</name>
    <comment>% скидки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_СкидкиПоставщика/ManagerModule.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ПолучитьПустуюТаблицуНаборЗаписей() Экспорт
	
	НаборЗаписей 		= РегистрыСведений.ЖБИ_СкидкиПоставщика.СоздатьНаборЗаписей();	
	ТаблПлановыхСтавок 	= НаборЗаписей.ВыгрузитьКолонки();
	
	Возврат ТаблПлановыхСтавок;
	
КонецФункции

Функция СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей, СписокСвойствОбновления = Неопределено, СтруктураПоиска = Неопределено, СообщениеОбОшибке) Экспорт
	
	Для Каждого СтрокаНабораЗаписей Из ТаблицаНабораЗаписей Цикл	
		
		НаборЗаписей = РегистрыСведений.ЖБИ_СкидкиПоставщика.СоздатьНаборЗаписей();	
		Отбор = НаборЗаписей.Отбор;
		Отбор.Партнер.Установить(СтрокаНабораЗаписей.Партнер);
		Отбор.НоменклатураПоставщика.Установить(СтрокаНабораЗаписей.НоменклатураПоставщика);
		Если СтруктураПоиска<>Неопределено Тогда
			Для Каждого СтрокаПоиска Из СтруктураПоиска Цикл 
				Отбор[СтрокаПоиска.Ключ].Установить(СтрокаПоиска.Значение);	
			КонецЦикла;
		КонецЕсли;		
		НаборЗаписей.Прочитать();	
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл
				
				Если СписокСвойствОбновления = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей);
				Иначе
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей, СписокСвойствОбновления);
				КонецЕсли;		
			КонецЦикла;
			
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		Иначе 
			МенеджерЗаписи = РегистрыСведений.ЖБИ_СкидкиПоставщика.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаНабораЗаписей);
			
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
								
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции

#КонецОбласти
